app/views/favorites/_like.html.erb

SELECT  1 AS one FROM "favorites" WHERE "favorites"."book_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["book_id", 6], ["user_id", 5], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
<% if user_signed_in? %>
  <% unless book.favorite_user(current_user.id).blank? %>