app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
    @user = @book.user
    @bookn = Book.new
    @comment = BookComment.new
    @comments = BookComment.all
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]

  def create
    #books = Book.allはrender :indexをするとindexアクションを経由せずビューに行くから必要
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    @user = @book.user
    @books = Book.all
    respond_to do |format|
      if @book.save
---
SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "opinion", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "おい"], ["opinion", "おい"], ["created_at", "2019-09-11 08:04:43.008703"], ["updated_at", "2019-09-11 08:04:43.008703"], ["user_id", 5]]

  def update
    book = Book.find(params[:id])
    if book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "opinion" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "riku"], ["opinion", "riku"], ["updated_at", "2019-08-01 11:45:29.436474"], ["id", 4]]

  def search
    @books = Book.search(params[:search], params[:search_select], params[:search_method])
    @users = User.search(params[:search], params[:search_select], params[:search_method])
---
SELECT "books".* FROM "books" WHERE (title LIKE '%riku%' OR opinion LIKE '%riku%')
SELECT "users".* FROM "users" WHERE (username LIKE '%投稿%')