app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["created_at", "2019-06-02 18:04:09.517124"], ["updated_at", "2019-06-02 18:04:09.517124"]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
	def create
		@favorite = Favorite.create(user_id: current_user.id, book_id: params[:book_id])
		@favorites = Favorite.where(book_id: params[:book_id])

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["user_id", 5], ["book_id", 6], ["user_id", 5], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
	def destroy
		favorite = Favorite.find_by(user_id: current_user.id, book_id: params[:book_id])
		favorite.destroy
		@favorites = Favorite.where(book_id: params[:book_id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
---
	def set_variables
		@book = Book.find(params[:book_id])