app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
    @book = Book.new
    @books = Book.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]

  def update
  	@user = User.find(params[:id])
  	if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_id", "13db97244c305e18ce2928fb9e0ad478dd087889f2ab4fae64cb977a1673"], ["introduction", "as"], ["updated_at", "2019-09-21 04:32:32.004874"], ["id", 5]]

  def following
    @book = Book.new
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def followers
    @book = Book.new
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def search
    @users = User.search(params[:search], params[:search_select], params[:search_method])
---
SELECT "users".* FROM "users" WHERE (username LIKE '%ko%')