app/models/user.rb

  def follow!(other_user)
  	relationships.create!(followed_id: other_user.id)
---
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["followed_id", 1], ["created_at", "2019-06-06 14:06:28.544506"], ["updated_at", "2019-06-06 14:06:28.544506"]]

  def unfollow!(other_user)
  	relationships.find_by(followed_id: other_user.id).destroy
---
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]